app/controllers/statuses_controller.rb

  def index
    @statuses = Status.order(created_at: :desc).limit(10)
---
SELECT  "statuses".* FROM "statuses"  ORDER BY "statuses"."created_at" DESC LIMIT 10

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("state", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["state", 0], ["message", "Whoop there it is!"], ["created_at", "2015-09-15 16:40:40.167765"], ["updated_at", "2015-09-15 16:40:40.167765"]]